using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class DialogueMass : MonoBehaviour
{
    public static string[] Rus =
    {
            "LexusLight", //0
            "При поддержке \n Abysmalduck", //1
            "GoldenSoul.",//2
            "~ Надежда. Вера. Судьба. \n Всё тщетно...",//3
            "~ Каждый, кто попадает в зачарованный лес, остаётся здесь навсегда.",//4
            "~ Это просто плохой сон?",//5
            "~ Нет, ведь ты не спал буд-то целую вечность.",//6
            "Всё что осталось, это твоё имя. \nПотеря имени равносильна потере всего, что у вас было.",//7
            "Тебя зовут Каспиан.",//8
            "Пожалуйста, запомни это имя.",//9
 /*cat1*/   "Эй, Приятель! Плохое ты выбрал место, чтобы вздремнуть.",//10
            "Ха-ха, ты бы видел своё лицо! Будто призрака увидел!",//11
            "Слушай, я вижу роща на тебя плохо влияет, даже говорить ты не в силах... К Счастью я знаю как обратить этот эффект в обратную сторону.",//12
            "Мне лично всё равно, но если хочешь - пошли со мной.",//13
            "В давние времена, маги из разных частей света искали диковенные плоды, называемые 'Сердце Ночи', чтобы дать жизнь неодушевлённым предметам.",//14
            "В этой роще как-раз растут эти редкие и древние плоды. Собрав достаточно осколков этого плода, можно вернуть себе ДУШУ.",//15
            "Вон там один растёт.",//16
            "Не бойся, я не какой-то змей-искуситель. Не будет 'Плохих Эффектов', в твоём случае, Только хорошие.",//17  
            "Огромный блестящий отполированный меч.", //18
            "Он торчит в огромном блестящем отполированном камне.",//19
            "Вы пытаетесь отделить этот прекрасный камень от ненужного металлолома. Не получилось.",//20
            "На что ты вообще надеялся? Тут же написано 'Только для героев.'",//21
            "Ты же не герой.",//22
            "'Той, что достала звезду с неба.'",//23
            "Она не идеальная, но она твоя.",//24
            "Привет! Добро пожаловать в Демоверсию GS!",//25
            "Что такое - Демоверсия GS?",//26
            "Понятия не имею, я же всего-навсего ломающий четвёртую стену кот.",//27
            "В любом случае, тебе стоит идти дальше.",//28
            "Максимум твоя душа способна держать 4 жизни.",//29
            "Моя душа - способна держать целых 9 жизней. Ведь я кот.",//30
            "Подбери СЕРДЦЕ НОЧИ на клавишу 'Е', чтобы восполнить свои жизни.",//31
            "Ну, теперь время решать посредственные головоломки...",//32
            "Найди комбинацию сам, мне лень обьяснять.",//33
            "Слушай! Впереди тебя ждёт босс! Хочешь жить - умей вертеться.",//34
            "Уворачивайся от атак босса, после чего атакуй его, как только тот заснёт.",//35
            "Подбирай жизни во время боя. Они ЗОЛТОГО ЦВЕТА.",//36
            "Итак, покажи 'Кто тут главный'!",//37
            "Я.",//38
            "Вот это да! Тебе удалось победить Босса! Грацио!",//39
            "Впринципе мини-демоверсия подходит к концу...",//40
            "Благодаря поддержке сообщества, мы делаем карты, головоломки, диалоги, сюжет...",//41
            "Но нам многое ещё предстоит сделать: написать музыку, написать кучу кода.....",//42
            "Если хочешь, можешь поддержать разработчиков, это будет клёво)",//43
            "Минутку, о чём я говорю? Я же всего-лишь кот!",//44
            "Впрочем, неважно.",//45
            "~Какие у меня крутые очки... Надо бы организовать свой Гуррен-дан!",//46
            "Ась? Ты ещё здесь?",//47
            "Alt+f4 в помощь. Удачи :3",//48

    };
    public static string[] Eng =
{
            "LexusLight", //0
            "together with \n Abysmalduck",//1
            "GoldenSoul.",//2
            "~ Hope. Faith. Fate. \nAll in vain.",//3
            "~ All who's included in the Enchanted Forest,stays there forever.",//4
            "~ Maybee is this just a bad dream?",//5
            "~ No, because you haven't slept eternity.",//6
            "All that's left is your name. \nLosing a name is tantamount to losing everything.",//7
            "Your name is Caspian.",//8
            "Please remember it.",//9
            "1",//10
            "2",//11
            "3",//12
            "4",//13
            "5",//14
            "6",//15
            "7",//16
            "8",//17
    };
}
